# Set Theory in SQL: Classlist Database
© Explore Data Science Academy

## Instructions to Students

This challenge is designed to determine how much you have learned so far and will test your knowledge set theory through the use of SQL queries.

The answers for this challenge should be selected on Athena for each corresponding Multiple Choice Question. The questions are included in this notebook and are numbered according to the Athena Questions, the options to choose from for each question has also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good Luck!_**

## Honour Code

I YOUR NAME, YOUR SURNAME, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The Classlist Database

![Hi](https://upload.wikimedia.org/wikipedia/commons/3/39/Student_in_Class_%283618969705%29.jpg)

The Classlist database contains the records of multiple students who have undertaken primary and supplementary examinations in multiple subjects. This data is split across two tables: 

 - **Exammarks**; and 
 - **Supplementarymarks**

Unlike our previous challenge, we leave it up to you to investigate the contents of these tables and the various attributes they contain.

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment. You can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `classlist.db`sqlite file from Athena and have stored it in a known location. 

Now that you have all the prerequistes you can go ahead and load it into the notebook.

In [2]:
%load_ext sql

In [3]:
%%sql 

sqlite:///classlist.db

In [4]:
%%sql 

SELECT * FROM sqlite_master WHERE type='table';

 * sqlite:///classlist.db
Done.

[('table', 'exammarks', 'exammarks', 2, 'CREATE TABLE `exammarks` (\n  `StudentNo` varchar(50) NOT NULL\n,  `Surname` varchar(50) NOT NULL\n,  `Name` varchar(50) NOT NULL\n,  `Gender` varcha ... (78 characters truncated) ... ULL\n,  `Science` integer DEFAULT NULL\n,  `Biology` integer DEFAULT NULL\n,  `Accounting` integer DEFAULT NULL\n,  `CompSci` integer DEFAULT NULL\n)'),
 ('table', 'supplementarymarks', 'supplementarymarks', 5, 'CREATE TABLE `supplementarymarks` (\n  `StudentNo` varchar(50) NOT NULL\n,  `Surname` varchar(50) NOT NULL\n,  `Name` varchar(50) NOT NULL\n,  `Gende ... (117 characters truncated) ... ULT NULL\n,  `Biology` integer DEFAULT NULL\n,  `Accounting` integer DEFAULT NULL\n,  `CompSci` integer DEFAULT NULL\n,  PRIMARY KEY (`StudentNo`)\n)'),
 ('table', 'sysdiagrams', 'sysdiagrams', 7, 'CREATE TABLE `sysdiagrams` (\n  `name` varchar(160) NOT NULL\n,  `principal_id` integer NOT NULL\n,  `diagram_id` integer NOT NULL\n,  `version` integer DEFAULT NULL\n,  `definition` longblob\n,  PRIMARY KEY (`diagram_id`)\n,  UNIQUE (`principal_id`,`name`)\n)')]

## Questions on Set Theory 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

**Question 2**

How many students did not write any of their final exams?

**Options:** 
 - 5
 - 95
 - 70
 - 25

**Solution**

In [15]:
%%sql 
SELECT COUNT(StudentNo) FROM supplementarymarks WHERE Maths is null OR  Science is null OR Biology is null OR Accounting is null OR CompSci is null

 * sqlite:///classlist.db
Done.

[(70,)]

**Question 4**

What are the names of the students in the grade who scored the highest marks for Science? _(hint: you need to consider the exam AND supplementary exam marks)_

**Options:**
 - Jack and Jane
 - Joe and Duane
 - Leroy and Harold
 - Craig and Danielle

**Solution**

In [18]:
%%sql 
SELECT Name, Science FROM (
SELECT * FROM exammarks
UNION
SELECT * FROM supplementarymarks)
ORDER BY Science DESC
LIMIT 5

 * sqlite:///classlist.db
Done.

[('DANIELLE', 100), ('CRAIG', 100), ('BILLIE', 99), ('DUANE', 99), ('JOE', 97)]

**Question 5**

How many students had to re-write their Maths and science exam? *(hint: a passing mark is considered to be 50 or greater)*

**Options:**
 - 12
 - 4
 - 20
 - 9

**Solution**

In [7]:
%%sql 
SELECT COUNT(*) FROM exammarks WHERE Maths < 50 AND Science < 50

 * sqlite:///classlist.db
Done.

[(4,)]

**Question 6**

What was the average mark, rounded down, for students who wrote the supplementary accounting exam after missing the first?

**Options:**
 - 73
 - 79
 - 76
 - 82

**Solution**

In [20]:
%%sql
SELECT AVG(Accounting) FROM (SELECT Name, Accounting FROM supplementarymarks
EXCEPT
SELECT Name, Accounting FROM exammarks)
WHERE Accounting IS NOT NULL

 * sqlite:///classlist.db
Done.

[(73.84375,)]

In [9]:
%%sql 

SELECT ROUND((AVG(Accounting)-0.5), 0) FROM supplementarymarks

 * sqlite:///classlist.db
Done.

[(73.0,)]

**Question 7**

What was the average mark, rounded down, for students who wrote the supplementary accounting exam after failing the first?

**Options:**
 - 79
 - 82
 - 76
 - 73

**Solution**

In [22]:
%%sql 

SELECT AVG(Accounting) FROM (
SELECT * FROM Supplementarymarks EXCEPT
    SELECT * FROM Exammarks WHERE accounting <50
) as j;

 * sqlite:///classlist.db
Done.

[(73.84375,)]

**Question 9**

What is the Full name of the student in the grade who scored the highest mark for Biology? *(hint: consider both supplementary and exam marks)*
 
 **Options:**
 - Tracy Grady
 - Bertha Hoff
 - Daryl Finn
 - Lillie Deaton

**Solution**

In [ ]:
%%sql 
SELECT * FROM exammarks
UNION 
SELECT * FROM supplementarymarks
ORDER BY Biology DESC
LIMIT 10

**Question 10**

Assuming all subjects are weighted equally, what was the average total mark, rounded down, for students who didn’t write any supplementary exams?
 
**Options:**
 - 74
 - 66
 - 73
 - 76

**Solution**

In [25]:
%%sql 
SELECT AVG(total) FROM (SELECT (Maths+Science+Biology+Accounting+CompSci)/5 AS total FROM (
SELECT * FROM exammarks   
UNION
SELECT * FROM Supplementarymarks WHERE Maths IS NULL AND Science IS NULL AND Biology IS NULL AND Accounting IS NULL AND CompSci IS NULL
));

 * sqlite:///classlist.db
Done.

[(66.62765957446808,)]